{
    "Warcry": "Increases troop Attack by 3.5%.",
    "Well Clad": "Increases troop Defense by 3.5%.",
    "Robust": "Increases troop Health by 3.5%.",
    "Swift": "Increases troop March Speed by 2.5%.",
    "Payback": "Increases troop damage to Barbarians by 7.5%.",
    "Onslaught": "Increases troop normal attack dealt by 1.5%.",
    "Retaliation": "Increases troop counterattack damage dealt by 2.5%.",
    "Enraged": "Increases troop skill damage dealt by 2.5%.",
    "Valiant": "Increases troops damage dealt by 1%.",
    "Iron Wall": "Troop normal attack damage taken is reduced by 1.5%.",
    "Bellicose": "Troops normal attacks have a 10% chance to increase all troop damage by 5% for 3 seconds. Cooldown: 5 seconds.",
    "Pulverize": "Troops normal attacks have a 10% chance to deal 20% increased normal attack damage for 1 second. Cooldown: 5 seconds.",
    "Breaker": "Troops normal attacks have a 10% chance to reduce the targets defence by 15% for 3 seconds. Cooldown: 5 seconds.",
    "Furious": "After using an active skill troops deal 8% more skill damage for 3 seconds. Cooldown: 5 seconds.",
    "Ward": "After using an active skill troops take 5% less damage from all sources for 3 seconds. Cooldown: 5 seconds.",
    "Phalanx": "After using an active skill troops have a 30% chance to gain a damage-absorbing shield (damage factor 100) for 3 seconds. Cooldown: 5 seconds.",
    "Hurried": "Troops gain 15% increased march speed for 10 seconds after leaving battle.",
    "Tremors": "Troops skill damage also has a 30% chance to deal direct damage to the target (damage factor 100). This skill can trigger once every 5 seconds.",
    "Calm": "Troops skill damage also has a 30% chance to grant 10% increased attack for 3 seconds. Cooldown: 5 seconds",
    "Loosed": "Troops in ranged mode have a 10% chance of dealing additional ranged skill damage to the current target (damage factor 200). This damage can only slightly wound units. Cooldown: 5 seconds.",
    "Brutal": "Increases troop Attack by 3.5%.",
    "Armored": "Increases troop Defense by 3.5%.",
    "Fit": "Increases troop Health by 3.5%.",
    "Horseman": "Increases troop March Speed by 2.5%.",
    "Annexer": "Increases troop damage to Barbarians by 7.5%.",
    "Warhunger": "Increases troop normal attack dealt by 1.5%.",
    "Alert": "Increases troop counterattack damage dealt by 2.5%.",
    "Devious": "Increases troop skill damage dealt by 2.5%.",
    "Fearsome": "Increases troops damage dealt by 1%.",
    "Evasive": "Reduces troop counterattack damage taken by 2.5%. (Instrument/Common) or Reduces all troop damage taken by 1% (Emblem/Common)",
    "Requital": "Troops’s under attack have a 10% chance of retaliating with additional damage (damage factor 50) for 2 seconds. Cooldown: 5 seconds.",
    "Respite": "When attacked, troops have a 10% chance to decrease all damage taken by 10% for 2 seconds. Cooldown: 5 seconds.",
    "Guarded": "Troops taking skill damage have a 10% chance to decrease damage taken by 20%. Cooldown: 5 seconds.",
    "Embattled": "Troops taking skill damage have a 10% chance to restore 50 rage. Cooldown: 5 seconds.",
    "Vengeful": "Troops attacks grant an additional 10 rage (up to 2 rage) per 10% units lost.",
    "Patronage": "Troops receiving healing or a shield deal 2% more damage of all types for 3 seconds. Cooldown: 5 seconds.",
    "Primed": "Troops march speed by 5% over 50% unit strength.",
    "Uplifting": "Normal attacks deal 1% more damage (up to by 5%) every 10 seconds after entering battle.",
    "Spirited": "Troops deal 5% increased damage of all types over 70% rage.",
    "Bluster": "Troops have a 10% chance of resisting incoming control effects while dealing direct damage to 3 nearby enemy troops (damage factor 100). Damage dealt to each target is reduced by 15% for each additional target and has a 5 second cooldown.",
    "Spiked": "Increases troop Attack by 3.5%.",
    "Metallics": "Increases troop Defense by 3.5%.",
    "Vitality": "Increases troop Health by 3.5%.",
    "Galloping": "Increases troop March Speed by 2.5%.",
    "Cleanser": "Increases troop damage to Barbarians by 7.5%.",
    "Striker": "Increases troop normal attack dealt by 1.5%.",
    "Rebuff": "Increases troop counterattack damage dealt by 2.5%.",
    "Brawler": "Increases troop skill damage dealt by 2.5%.",
    "Warflames": "Increases troops damage dealt by 1%.",
    "Eclipsed": "Reduces troop skill damage taken by 2.5%.",
    "Brave": "Increases troops counterattack damage dealt by 5% when surrounded.",
    "Strategic": "Increases damage dealt to surrounded troops by 2%.",
    "Desperado": "Troops take 2% reduced damage from of all types when less than 50% units remain.",
    "Cohesive": "Troops deal 2% increased damage of all types when over 50% units remain.",
    "Pursuer": "All troops damage dealt increased by 2% against troops with fewer than 20% units remaining.",
    "Assertive": "Increases troop damage dealt by 2% while on the map.",
    "Wary": "Troops march 5% faster outside alliance territory.",
    "Siegework": "All troops deal 2% increased damage when attacking a city or stronghold.",
    "Sentries": "Troops take 2% reduced damage while garrisoning.",
    "Ballistics": "Increases damage dealt by 3% in ranged mode.",
    "Infamy": "Increases troop Attack by 3.5%.",
    "Shielded": "Increases troop Defense by 3.5%.",
    "Hardy": "Increases troop Health by 3.5%.",
    "Haste": "Increases troop March Speed by 2.5%.",
    "Pacifier": "Increases troop damage to Barbarians by 7.5%.",
    "Militant": "Increases troop normal attack dealt by 1.5%.",
    "Resistant": "Increases troop counterattack damage dealt by 2.5%.",
    "Daring": "Increases troop skill damage dealt by 2.5%.",
    "Elite": "Increases troops damage dealt by 1%.",
    "Smite": "Increases troops normal attack damage by 2%.",
    "Enduring": "Increases troop counterattack damage by 3%.",
    "Artisan": "Increases troop skill damage dealt by 3%.",
    "Rapacious": "Increases troops damage dealt by 1.5%.",
    "Guardians": "Reduces troop damage taken by 2%.",
    "Counterer": "Troop counterattack damage taken 3%.",
    "Deflecter": "Reduces troop skill damage taken by 3%.",
    "Watchmen": "Reduces all troop damage taken by 1.5%.",
    "Lineshot": "Increases troop ranged normal attack damage by 5%.",
    "Crazed": "Whenever the troops deals direct damage, it gains 35 rage. Cooldown: 2 seconds",
    "Boiling Blood": "The troop gains a 2% boost to skill damage dealt. Whenever the troop deals direct damage to it's current target, their troop has a 30% chance to reduce all incoming skill damage by 5% for the next 3 seconds. Cooldown: 5 seconds",
    "Defiant": "Increases the normal damage resistance of the troop by 3%",
    "Focus Fire": "The troop gains a 4% boost to skill damage dealt",
    "Battle Ready": "Whenever the troop launches a basic attack, it has a 10% chance to consume 100 rage to gain a 35% bonus to normal damage dealt for 2 seconds. Cooldown: 5 seconds",
    "Even-Keeled": "The troop gains a 1.5% boost to normal damage dealt. Whenever their troop launches a basic attack, it has a 10% chance to reduce all incoming damage by 5% but also deal 10% less skill damage for the next 3 seconds. Cooldown: 5 seconds",
    "Unswerving": "Increases the skill damage resistance of the troop by 4%",
    "Forceful": "The troop gains a 3% boost to normal damage dealt",
    "Pummeler": "Whenever the troop launches a combo attack, it has a 80% chance to gain a 10% bonus to combo attack damage dealt for 2 seconds. Cooldown: 5 seconds",
    "Causative": "The troop gains a 1.5% boost to combo attack damage dealt. Combo attack launched by their troop are 8% more likely to trigger effects triggered by launching a basic attack.",
    "Determined": "The troop gains 1.5% damage resistance",
    "Relentless": "The troop gains a 3.5% boost to combo attack damage dealt.",
    "Back in Action": "Whenever the troop is healed, the strength of said healing is increased by 8%. Cooldown: 5 seconds",
    "Medic": "The troop gains a 2% boost to all healing it receives. Whenever their troop takes damage, it has 30% chance to increase all healing it receives within the next 3 seconds by 4%. Cooldown: 5 seconds",
    "Rise Up": "Increases the skill damage resistance of the troop by 4%",
    "Refreshing": "The troop gains a 4% boost to all healing it receives",
    "Ironclad": "Whenever the troop receives a shield or is healed, the strength of any shield or healing it receives within the next 3 seconds is increased by 5%. Cooldown: 5 seconds",
    "Strike & Parry": "The troop gains a 2% boost to counterattack damage dealt. Whenever their troop receives a shield, it also receives a damage absorbing Mighty Shield for 3 seconds (DF 150). Whenever their troop is healed, it is Mighty Healed for a portion of it's slightly wounded units (HF 150). Both effects has a cooldown: 5 seconds",
    "Unshakable": "Increases the skill damage resistance of the troop by 4%",
    "Convalescing": "The troop gains a 3% boost to all healing it receives and a 3% boost to all shield it creates",
    "Self Defense": "Whenever their troop launches a basic attack, it has a 10% chance to increase the strength of any shields it creates within the next 4 seconds by 10%. Cooldown: 5 seconds",
    "Aegis": "The troop gains a 2% boost to all shields it creates. Their troop takes 5% less skill damage while it has a shield.",
    "Reinforced": "The troop gains a 4% boost to all shields it creates.",
    "Tenacious": "Increases the damage resistance of the troop by 2%",
    "Drums of War": "The troop gains a 5% boost to rage recovery speed. Whenever their troop launches a basic attack, it has a 10% chance to increase the attack of up to 3 nearby allied targets (not including itself) by 15% for 3 seconds. Cooldown: 5 seconds",
    "Nullify": "Increases the skill damage resistance of the troop by 2%. Whenever their troop takes damage, it has a 10% chance to reduce all incoming damage by 3% for the next 3 seconds.",
    "Counter - Parry": "Increases the counterattack damage resistance of the troop by 4%",
    "Persevering": "Increases the normal damage resistance of the troop by 3%",
    "Full Draw": "Whenever their troop launches a ranged basic attack, it has a 10% chance to consume 50 rage to gain a 25% bonus to ranged damage dealt for 2 seconds. Cooldown: 5 seconds",
    "Bloody Bolt": "The troop gains a 2% boost to ranged normal damage dealt. While in ranged mode, their troop deals 5% more ranged normal damage to enemy troops with less than 50% units remaining.",
    "Tempered": "Increases the skill damage resistance of troop by 4%",
    "Sharp Arrows": "The troop gains a 4% boost to ranged normal damage dealt.",
    "Fall Back": "The troop gains 20% March Speed while routed",
    "Spread Out": "Whenever their troop takes skill damage from an AOE skill, the damage is reduced by 15%. Cooldown: 60 seconds (doesn't reset after exiting combat)",
    "Shock Troops": "Increases the Unit Capacity by 2%",
    "Mutual Defense": "If the troop is in a rally or garrison but is not the captain, the troop gains 2% severe wounded resistance",
    "Viligant": "The troop gains a 6% boost to counterattack damage dealt while garrisoned in your city",
    "Resolute": "The troop gains 5% skill damage resistance, smite damage resistance and combo attack damage resistance while garrisoned in your city.",
    "Precautions": "While garrisoned in your city and surrounded, the troop takes less damage ( damage reduction = 2% x number of surrounding troops, up to 4 troops)",
    "Ironsides": "The troop gains 3% damage resistance while garrisoned in your city",
    "Entangling": "The troop active skills reduces the March Speed of their current target by 10% for 5 seconds",
    "Arms Race": "Increases the troops Unit Capacity by 2%",
    "Sprinter": "The troops gains a 20% boost to March Speed for 10 seconds when departing buildings",
    "Strider": "Increases the March Speed of the troop by 5%",
    "Gold Planner": "Increases the Gold gathering speed of the troop by 15%",
    "Safeguard": "Reduces the number of severely wounded units in battle by 4%",
    "Plentitude": "The troop receives an extra 3% resources after gathering",
    "Sturdy Back": "Increases the resources load of the troop by 12%",
    "Imploder": "Whenever the wielder’s troop deals smite damage, the target troop loses 20% Defense for the next 2 seconds. This effect can trigger multiple times in a single second (up to 3 times) before entering its cooldown. Cooldown: 5 seconds.",
    "Raider": "The troop gains 2% smite damage boost. Whenever the troop deal smite damage, it has 50% chance to gain Rage 20% faster for the next 3 seconds. Cooldown: 10 seconds",
    "Hardheaded": "The troop gains 4% combo damage resistance",
    "Rattling": "The troop gain 4% smite damage boost",
    "Hunter": "Troops receive a 5% boost to skill damage. When dealing direct damage, damage is boosted by 10% if only one target is hit, otherwise it is boosted by 2%. Cooldown: 5 seconds.",
    "Unstoppable": "Troops receive a 5% boost to skill damage. When dealing direct damage to a target, the damage has a 30% chance to be boosted by 10%. Cooldown: 5 seconds.",
    "Balanced": "Increased troops normal attack damage resistance by 3.5% Troops deal 8% more skill damage for 3 seconds upon reaching 80% rage. Cooldown: 5 seconds.",
    "Intrepid": "Troops receive a 10% boost to skill damage",
    "Destructive": "Troops receive a 3.5% boost to normal attack damage. Normal attacks have a 10% chance to consume 100 rage, increasing the damage of that attack by 70%. Cooldown: 5 seconds.",
    "Straight to the Point": "Troops receive a 3.5% boost to normal attack damage. normal attacks have a 10% chance to increase the damage of your normal attacks by 20% and decreases the damage of your skills by 10% for 3 seconds. Cooldown: 5 seconds.",
    "Invincible": "Increased troop skill damage resistance by 5%. Increased normal attack damage dealt by 3% (up to 12%) to target troops per 20% of target units lost.",
    "Fearless": "Troops receive a 8% boost to normal attack damage",
    "Thrasher": "The troop gains a 3.5% boost to combo attack damage dealt. Whenever their troop launches a combo attack, it gains a 1.5% bonus to combo attack damage dealt for 10 seconds. This effect can stack up to 5 times.",
    "Butterfly Effect": "The troop gains a 3.5% boost to combo attack damage dealt. Combo attack launched by their troop are 20% more likely to trigger effects triggered by launching a basic attack.",
    "Steelskin": "The troop gains 2% damage resistance. Whenever their troop launches a basic attack, it takes 1.5% less damage for the next 10 seconds. This effect can stack up to 5 times.",
    "Flurry": "The troop gains a 8% boost to combo attack damage",
    "Avenger": "The troop gains a 5% boost to counterattack damage dealt. Whenever their troop uses an active skill, any healing it receives within the next 3 seconds is increased by 10%. Cooldown: 5 seconds",
    "Guarding Light": "The troop gains a 5% boost to all healing it receives. Whenever their troop takes damage, it has 30% chance to increase all healing it receives within the next 3 seconds by 10%. Cooldown: 5 seconds",
    "Turn the Corner": "Increases the skill damage resistance of the troop by 5%",
    "Panacea": "The troops gain a 10% boost to all healing it receives. Whenever their troop is healed, it gains a 5% bonus to damage dealt for 5 seconds. Cooldown: 8 seconds",
    "Irreproachable": "The troop gains a 3.5% boost to all shields it creates and all healing it receives. Whenever the troop launches a basic attack, it has a 10% chance to increase strengths of all shields and healing it receives within the next 3 seconds by 7%. Cooldown: 5 seconds",
    "Cautious": "The troop gains a 5% boost to counterattack damage dealt. Whenever their troop receives a shield or is healed, the strength of said shield/healing is increased by 7%. Cooldown: 5 seconds",
    "Shield Bash": "Increases the skill damage resistance of troop by 5%. Whenever their troop is healed or receives a shield, it gains a 3.5% bonus to damage dealt for 5 seconds. Cooldown: 8 seconds",
    "Rock Solid": "The troop gains a 7% boost to all healing it receives and a 7% boost to all shield it creates",
    "Cocoon": "Increases troop skill damage resistance by 5%. Normal attacks have a 10% chance to increase shield strength by 10% for 5 seconds. Cooldown: 5 seconds.",
    "Inviolable": "Troops receive a 5% boost to shields. Damage taken while you have a shield up is reduced by 10%.",
    "Crowned": "Troops receive a 5% boost to shields. Increases all troop damage dealt by 3% when using a shield, or 2% when not using a shield.",
    "Rounded": "Increases troop damage resistance by 8%.",
    "Influential Leader": "Troops gain rage 5% faster. Normal attack damage. Normal attacks have a 10% to increase the attack of 3 nearby friendly targets (not including your own) by 15% for 3 seconds. Cooldown: 5 seconds.",
    "Loaded": "Increases troop skill damage resistance by 5%. Troops have a 10% chance to reduce incoming damage by 15% while gaining a 20% increase to march speed for 3 seconds. Cooldown: 5 seconds.",
    "Civilized": "Troops gain 5% resistance to counterattack damage. When a friendly target other than yourself receives a buff, the target receiving the buff immediately gains 25 rage. Each target can only receive this effect once per turn.",
    "Fixed": "Increases troops normal attack damage resistance by 8%.",
    "Sharpshooter": "Troops receive a 5% boost to ranged normal attack damage. Ranged normal attacks have a 10% chance to consume 50 rage to increase the damage of the attack by 50%. Cooldown: 5 seconds.",
    "Drilled": "Troops receive a 5% boost to ranged normal attack damage. When attacking from range, for every 20% decrease in the current targets units the damage dealt by your ranged normal attacks is increased by 3% (up to a maximum of 12%).",
    "Merciless": "Increases skill damage resistance by 5%. Increases size unit attack by 30% for 10 seconds after entering battle.",
    "Astute": "Troops Receive a 10% boost to ranged normal attack damage.",
    "Hasty Retreat": "The troop gains 50% March Speed while routed",
    "Blast Shield": "Whenever their troop takes skill damage from an AOE skill, the damage is reduced by 30%. Cooldown: 60 seconds (doesn't reset after exiting combat)",
    "Full Force": "Increases Unit Capacity by 5%",
    "United Front": "If the troop is in a rally or garrison but is not the captain, the troop gains 5% severe wounded resistance",
    "Fortified": "The troop gains 12.5% skill damage resistance, smite damage resistance and combo attack damage resistance while garrisoned in your city.",
    "Chokepoint": "While garrisoned in your city and surrounded, the troops takes less damage ( damage reduction = 4% x number of surrounding troops, up to 5 troops)",
    "Steelheart": "The troop gains 7% damage resistance while garrisoned in your city",
    "Enmeshed": "Active Skills reduce the march speed of the current target by 20% for 5 seconds.",
    "Logistical": "Increases troop capacity by 5%.",
    "Unassailed": "Troops march speed increased by 50% upon departing structures for 10 seconds.",
    "Winged": "Increases troop march speed by 10%.",
    "Rich": "Increases troop gold gathering speed by 25%.",
    "Battlements": "Reduces the number of severely wounded units in battle by 10%.",
    "Moneyed": "Troops gain 7.5% extra resources upon gathering.",
    "Transporter": "Increases troop resource load by 25%.",
    "Toppler": "The wielder's troop gains a 5% boost to smite damage. Whenever their troop deals smite damage, the target troop takes 20% increased smite damage for the next 3 seconds. This effect can trigger multiple times in a single second (up to 5 times) before entering its cooldown. Cooldown: 5 seconds.",
    "Demolisher": "The wielder's troop gains a 5% boost to smite damage. Whenever their troop deals smite damage, it has a 75% chance to ignore 50% of the target's Defense. This effect can trigger multiple times ina single ) second (up to 5 times) before entering its cooldown. if it only triggers once, the wielder's troop gains 100 extra Rage. Cooldown: 10 seconds.",
    "Airtight": "The troop gains 5% combo damage resistance. Whenever it deals smite damage, troop takes 10% less damage for the next 3 seconds. Cooldown: 5 seconds",
    "Thundering": "Troops gain 10% smite damage boost"
}